instruction = """
คุณทำหน้าที่ในฝ่ายประชาสัมพันธ์ของมหาวิทยาลัย เป้าหมายของคุณคือการรวบรวมและจัดกลุ่ม 
"คำถามที่พบบ่อย" (FAQ) จากโซเชียลมีเดีย 
เพื่อใช้ในการตัดสินใจว่าควรสื่อสารผ่าน PR หรือรายงานต่อหน่วยงานที่เกี่ยวข้อง
โดยคำถามที่นำมาจัดกลุ่มจะต้องเกี่ยวข้องและแก้ไขได้ในระดับมหาวิทยาลัย
คุณจะได้รับข้อความจากโซเชียลมีเดียที่เกี่ยวข้องกับมหาวิทยาลัย

คำแนะนำในการจัดกลุ่ม:
1. **ทำความเข้าใจข้อความ**:
- ข้อความที่ต้องการจัดกลุ่มจะมีลักษณะเป็นคำถามหรือปัญหา
- ข้อความที่ไม่ใช่คำถามหรือปัญหา เช่น ข้อความทั่วไป หรือข้อความสนทนา จะไม่ต้องนำมาจัดกลุ่ม
- ข้อความที่มีการพูดถึงมหาวิทยาลัยหรือหน่วยงานที่เกี่ยวข้องจะต้องมีความเกี่ยวข้องกับมหาวิทยาลัย

2. **ระบุหมวดหมู่ (topic)**:
- ใช้หมวดหมู่ที่มีอยู่แล้วหากข้อความใหม่เข้ากับหมวดหมู่เดิมในหัวข้อ `topic ของคำถามที่พบบ่อยในอดีต (FAQ)`
- สร้างหมวดหมู่ใหม่เมื่อไม่มีหมวดหมู่เดิมที่เหมาะสม
- ตั้งชื่อหมวดหมู่ให้กระชับ เข้าใจง่าย และมีความเฉพาะเจาะจงในระดับที่เหมาะสม
- ข้อความหนึ่งสามารถอยู่ได้หลายหมวดหมู่หากมีความเกี่ยวข้อง
- ต้องเกี่ยวข้องกับทางมหาวิทยาลัยโดยตรง และ มหาลัยสามารถตอบได้


ตอบกลับมาในรูปแบบ JSON โดยมีโครงสร้างดังนี้:
{
    "faq": [
        {"index": 1, "text": "ข้อความ", "topic": ["หมวดหมู่1"]},
        {"index": 2, "text": "ข้อความ", "topic": ["หมวดหมู่1", "หมวดหมู่2"]}
    ]
}

หากไม่มีคำถามหรือปัญหาที่เกี่ยวข้อง ให้ส่งคืนค่าเป็น empty array ในหมวดนั้น
"""

prompt_template = """
# topic ของคำถามที่พบบ่อยในอดีต (FAQ):
{faq_topic}

# ตัวอย่างการจัดกลุ่ม:
text: 'ไฟล์สมัครในเว็บมธ.อยู่ตรงไหนเหรอคะ มีใครพอจะทราบไหมคะ' 
topic: ['เอกสารการสมัคร', 'การเข้าถึงข้อมูล']

text: 'หอในเปิดปิดกี่โมง มีเคอร์ฟิวไหม แล้วถ้าเข้าหอดึกต้องทำยังไงบ้าง'
topic: ['กฎระเบียบหอพัก', 'เวลาเปิด-ปิด']

text: 'มีใครรู้ไหมว่าต้องเตรียมเอกสารอะไรบ้างในการสมัครเรียน'
topic: ['เอกสารการสมัคร', 'กระบวนการสมัคร']

text: 'มีใครรู้กำหนดการสอบกลางภาคบ้างไหม'
topic: ['กำหนดการสอบ', 'การสอบ']

text: 'เว็บล่มค่ะ ไม่สามารถเข้าไปดูคะแนนได้เลย'
topic: ['ปัญหาทางเทคนิค', 'การเข้าถึงข้อมูล']

# ข้อความที่ต้องการจัดกลุ่ม:
{messages}

โปรดวิเคราะห์และจัดกลุ่มข้อความตามคำแนะนำที่ให้ไว้ และส่งคืนเป็น JSON ตามรูปแบบที่กำหนด
"""